IDENTIFICATION DIVISION.
PROGRAM-ID. PIZZERIA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-CENA PIC 9(1)V9(5) VALUE 1.50.
01 WS-SUROVINY PIC 9(1)V9(5) VALUE 0.43.
01 WS-NAKLADY PIC 9(5)V9(5) VALUE 2000.
01 WS-POCET PIC 9(5)V9(5) COMP-3 VALUE 0.
01 WS-ROZDIEL PIC 9(1)V9(5) VALUE 0.
01 WS-RESULT PIC 9(4) VALUE 0.
PROCEDURE DIVISION.
SUBTRACT WS-SUROVINY FROM WS-CENA GIVING WS-ROZDIEL.
DIVIDE WS-NAKLADY BY WS-ROZDIEL GIVING WS-POCET.
ADD 1 TO WS-POCET GIVING WS-POCET.
MOVE WS-POCET TO WS-RESULT.
DISPLAY 'Pizzeria musí predať ' WITH NO ADVANCING.
DISPLAY WS-RESULT WITH NO ADVANCING.
DISPLAY ' pizz mesačne.'
STOP RUN.
